package com.learn.salaryapp;

/**
 * Создать базу данных сотрудников(управленцы и менеджеры). Каждый сотрудник принадлежит своему отделу и имеет определенную зарплату.
 * Зарплата сотруднику рассчитывается след. образом:
 * 1) Для управленца количество раб.дней * 1000
 * 2) Для менеджера количество раб.дней * 100
 * По запросу выводить:
 * - данные сотрудников, зарплата которых меньше 500 гривень
 * - данные управленцев и
 * - данные сотрудников, которые проработали больше 10, но меньше 20 раб. дней
 * <p>
 * В задаче использовать коллекции, внутренние классы, наследование и клонирование.
 * Управленцев и менеджеров хранить в одной коллекции.
 * Данные об отделе хранить в отдельной коллекции.
 */
public class Salary {
}
